{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20], "name": "input_66", "sparse": false}, "inbound_nodes": [], "name": "input_66"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_39", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_66", 0, 0, {}]]], "name": "dense_39"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_39", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_39", 0, 0, {}]]], "name": "batch_normalization_39"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_37"}, "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]], "name": "leaky_re_lu_37"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 6], "name": "input_67", "sparse": false}, "inbound_nodes": [], "name": "input_67"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24], "name": "input_68", "sparse": false}, "inbound_nodes": [], "name": "input_68"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_13", "axis": -1}, "inbound_nodes": [[["leaky_re_lu_37", 0, 0, {}], ["input_67", 0, 0, {}], ["input_68", 0, 0, {}]]], "name": "concatenate_13"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_40", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 56, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]], "name": "dense_40"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_40", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_40", 0, 0, {}]]], "name": "batch_normalization_40"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_38"}, "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]], "name": "leaky_re_lu_38"}], "input_layers": [["input_67", 0, 0], ["input_66", 0, 0], ["input_68", 0, 0]], "output_layers": [["leaky_re_lu_38", 0, 0]], "name": "model_19"}, "backend": "tensorflow"}