{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20], "name": "state", "sparse": false}, "inbound_nodes": [], "name": "state"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_42", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["state", 0, 0, {}]]], "name": "dense_42"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_42", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_42", 0, 0, {}]]], "name": "batch_normalization_42"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20], "name": "song_1", "sparse": false}, "inbound_nodes": [], "name": "song_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20], "name": "song_2", "sparse": false}, "inbound_nodes": [], "name": "song_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_40"}, "inbound_nodes": [[["batch_normalization_42", 0, 0, {}]]], "name": "leaky_re_lu_40"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 20], "name": "input_69", "sparse": false}, "name": "input_69"}, {"class_name": "Dense", "inbound_nodes": [[["input_69", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_41", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "name": "dense_41"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_41", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_41", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_41"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["batch_normalization_41", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_39"}, "name": "leaky_re_lu_39"}], "input_layers": [["input_69", 0, 0]], "name": "model_20", "output_layers": [["leaky_re_lu_39", 0, 0]]}, "inbound_nodes": [[["song_1", 0, 0, {}]], [["song_2", 0, 0, {}]]], "name": "model_20"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 6], "name": "history", "sparse": false}, "inbound_nodes": [], "name": "history"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24], "name": "user_features", "sparse": false}, "inbound_nodes": [], "name": "user_features"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_14", "axis": -1}, "inbound_nodes": [[["leaky_re_lu_40", 0, 0, {}], ["model_20", 1, 0, {}], ["model_20", 2, 0, {}], ["history", 0, 0, {}], ["user_features", 0, 0, {}]]], "name": "concatenate_14"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_43", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_14", 0, 0, {}]]], "name": "dense_43"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_43", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_43", 0, 0, {}]]], "name": "batch_normalization_43"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_41"}, "inbound_nodes": [[["batch_normalization_43", 0, 0, {}]]], "name": "leaky_re_lu_41"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_44", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_41", 0, 0, {}]]], "name": "dense_44"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_44", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_44", 0, 0, {}]]], "name": "batch_normalization_44"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_42"}, "inbound_nodes": [[["batch_normalization_44", 0, 0, {}]]], "name": "leaky_re_lu_42"}], "input_layers": [["state", 0, 0], ["song_1", 0, 0], ["song_2", 0, 0], ["history", 0, 0], ["user_features", 0, 0]], "output_layers": [["leaky_re_lu_42", 0, 0]], "name": "model_21"}, "backend": "tensorflow"}