{"class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 1.5, "mean": 5.0}}, "units": 1, "batch_input_shape": [null, 386], "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}